esp-cpp/espp/components/usb_device/example/sdkconfig.defaults
# This example uses the native USB-OTG peripheral, which is only available on the
# ESP32-S3 (also S2 / P4) -- NOT the classic ESP32. Pin the target here so a bare
# `idf.py build` (without an explicit `set-target`) does not fall back to esp32
# and fail to compile the USB device.
CONFIG_IDF_TARGET="esp32s3"

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable the TinyUSB CDC-ACM feature (provided by the managed espressif/esp_tinyusb
# component). The espp::UsbDevice CDC function drives a dedicated CDC-ACM
# interface over the native USB-OTG peripheral.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1

# Enable the TinyUSB vendor-specific class (this is THE key enablement for the
# vendor / WebUSB interface). esp_tinyusb gates CFG_TUD_VENDOR behind
# CONFIG_TINYUSB_VENDOR_COUNT; setting it > 0 compiles in the vendor class driver
# so espp::UsbDevice's vendor function (bInterfaceClass 0xFF + WebUSB) works.
CONFIG_TINYUSB_VENDOR_COUNT=1

# Enable the TinyUSB HID class driver. esp_tinyusb gates CFG_TUD_HID behind
# CONFIG_TINYUSB_HID_COUNT; setting it > 0 compiles in the HID class driver so
# espp::UsbDevice's HID function (gamepad report descriptor from hid-rp) works.
CONFIG_TINYUSB_HID_COUNT=1
